<?php

return [
    "emoji" => "🍅",
    "index" => [
        "title" => "توميتو بي اتش بي",
        "description" => "مجتمع حيث يمكن لمطوري بي اتش بي مشاركة معرفتهم وخبرتهم.",
        "actions" => [
            "register" => "إنشاء حساب",
            "open-source" => "مفتوح المصدر",
        ]
    ],
    "about" => [
        "title" => "مهاراتي",
        "description" => "كمطور، مصمم، مسوق لدي العديد من المهارات"
    ],
    "blog" => [
        "label" => "المدونة",
        "title" => "دعنا نتعلم",
        "sub" => "معناً",
    ],
    "contact" => [
        "label" => "تواصل معي",
        "title" => "تواصل معي",
        "time" => "أقدر وقتي، لذلك اجعله يستحق ذلك، و",
        "succinct" => "اجعله موجزًا",
        "support" => "للاستفسارات المتعلقة بالبرمجيات مفتوحة المصدر، استخدم قناة الدعم على الديسكورد أو مشاكل جيت هاب الخاصة بالحزمة"
    ],
    "services" => [
        "label" => "خدماتي",
        "title" => "كيف يمكنني",
        "sub" => "خدمتك؟",
        "more" => "اقرأ المزيد"
    ],
    "open-source" => [
        "label" => "مفتوح المصدر",
        "title" => "مفتوح المصدر",
        "sub" => "للجميع"
    ],
    "portfolio" => [
        "label" => "إعمالي",
        "title" => "نبني مشروعات",
        "sub" => "للشركات"
    ],
    "footer" => [
        "copyright" => "لتغير العالم يجب ان تؤمن اولاً بالتغير",
        "open-source" => "هذا الموقع مشروع مفتوح المصدر يمكنك استخدامه تحت ",
        "made" => "صنع بكل الفخر",
        "in" => "في مصر",
        "mit" => "رخصة MIT",
        "for" => "، من هذا",
        "link" => "الرابط",
    ],
    "share" => [
        "title" => "شارك على الشبكات الاجتماعية",
        "networks"=> [
            "facebook" => "شارك على الفيسبوك",
            "twitter" => "شارك على تويتر",
            "linkedin" => "شارك على لينكد إن",
            "whatsapp" => "شارك على الواتساب",
            "telegram" => "شارك على التيليجرام",
            "reddit" => "شارك على ريديت",
            "pinterest" => "شارك على بينتيريست",
        ]
    ],
    "filters" => [
        "search" => "بحث",
        "search-placeholder" => "ماذا تبحث عن؟",
        "sort" => "ترتيب",
        "sort-select" => [
            "popular" => "شائع",
            "recent" => "حديث",
            "alphabetical" => "أبجدي",
        ]
    ],
    "empty" => [
        "no" => "لا يوجد",
        "found" => "تم العثور عليه",
        "description" => "عذرًا، لم يتطابق بحثك مع أي شيء"
    ],
    "register" => [
        'title' => 'قم بتسجيل حسابك',
        'description' => 'قم بتسجيل حسابك الآن للحصول على تجربة مجانية',
        'form' => [
            'loginBy' => 'تسجيل الدخول بواسطة',
            'social' => [
                'github' => 'حساب جيت هاب',
                'discord' => 'حساب الديسكورد',
                'register' => 'اسم المستخدم في الديسكورد',
            ],
            'name' => 'اسم المستخدم',
            'id' => 'معرف فريد',
            'domain' => 'النطاق الفرعي',
            'email' => 'البريد الإلكتروني',
            'phone' => 'رقم الهاتف',
            'password' => 'كلمة المرور',
            'passwordConfirmation' => 'تأكيد كلمة المرور',
            'packages' => 'الإضافات',
            'packages_hint' =>  'حدد الإضافات التي تريد تثبيتها',
            'notifications' => [
                'error' => [
                    'title' => 'خطأ',
                    'body' => 'حدث خطأ أثناء تسجيل حسابك. يرجى المحاولة مرة أخرى.',
                ],
                'success' => [
                    'title' => 'برجاء التحقق من سيرفر دسكورد',
                    'body' => 'يمكنك الحصول علي كود التحقق من قناة #otp علي سيرفر دسكورد',
                ]
            ]
        ],
        'submit' => 'تسجيل',
        'already' => 'هل لديك حساب بالفعل؟',
        'login' => 'تسجيل الدخول',
    ],
    "login" => [
        'title' => 'تسجيل الدخول إلى حسابك',
        'description' => 'قم بتسجيل الدخول إلى حسابك الآن',
        'form' => [
            'email' => 'البريد الإلكتروني',
            'password' => 'كلمة المرور',
        ],
        'dont' => "ليس لديك حساب؟ يرجى",
        'register' => 'التسجيل',
        'login' => 'تسجيل الدخول',
        'or' => 'او',
        'notifications' => [
            'error' => [
                'title' => 'خطأ',
                'body' => 'يرجى التحقق من البريد الإلكتروني وكلمة المرور',
            ],
        ]
    ],
    "issues" => [
        "title" => "المشاكل",
        "description" => "المشاكل التي تم العثور عليها",
    ],
    "demos" => [
        "title" => "التجربة",
        "single" => "تجربة"
    ],
    "likes" => [
        "title" => "الاعجابات",
        "single" => "اعجاب",
        "post" => "المنشور",
        "action" => "اعجبني",
        "notifications" => [
            "title" => 'برجاء تسجيل الدخول',
            "body" => 'برجاء تسجيل الدخول للقيام بالاعجاب'
        ]
    ],
    "comments" => [
        "title" => "التعليقات",
        "single" => "تعليق",
        "post" => "المنشور",
        "comment" => "التعليق",
        "active" => "منشور",
        "edit" => "تعديل",
        "delete" => "حذف",
        "send" => "إرسال",
        "login" => "سجل الدخول",
        "leave" => "حتي تتمكن من ترك تعليق",
        "notifications" => [
            "edit" => [
                "title" => "تم تحديث التعليق",
                "body" => "تم تحديث تعليقك بنجاح"
            ],
            "delete" => [
                "title" => "تم حذف التعليق",
                "body" => "تم حذف تعليقك بنجاح"
            ],
            "create" => [
                "title" => "تم إضافة تعليق",
                "body" => "تم إضافة تعليقك بنجاح"
            ]
        ]
    ],
    "widgets" => [
        "demos" => "اجمالي التجارب",
        "likes" => "اجمالي الاعجابات",
        "comments" => "اجمالي التعليقات",
    ],
    "community"=>[
        "title" => "اهلاً بالمجتمع",
        "label" => "المجتمع",
        "description" => "مجتمع حيث يمكن لمطوري بي اتش بي مشاركة معرفتهم وخبرتهم.",
        "sub" => "دعونا نتواصل",
        "single" => "مجتمع"
    ]
];
